app/controllers/Home.php

SELECT *
FROM `books`
---
    public function bookUser($user_id){
        if(session()->get('id') && session()->get('id') == $user_id){
            $model = new BookModel;
            $this->dateBook();
            $data["books"] = $model->findAll();