app/controllers/loginController.php

SELECT *
FROM `command`
---
    public function command(){
        if(session()->get("admin")){
            $command = new CommandModel();
            $data["command"] = $command->findAll();

SELECT `email`, `id`
FROM `users`
WHERE `email` = 'rakoto@gmail.com'
AND `password` = '111'
 LIMIT 1
---
    public function login(){
        $model = new LoginUser();
        $data = [
            'email'=>$this->request->getPost('email'),
            'password'=>$this->request->getPost('password'),
        ];
        if ($data['email'] && $data['password']){
            $select = $model->select(['email', 'id'])->where('email', $data['email'])->where('password', $data['password'])->first();